""" Шаблонізатор Jinja

Створення чистих HTML-документів не є частим завданням у Python. Набагато частіше 
доводиться мати справу з попередньо сформованим HTML-документом, куди потрібно як у 
шаблон підставити потрібні змінні. Для цього дуже добре підходить пакет Jinja.

Встановимо Jinja: pip install jinja2

Jinja — це пакет для рендерингу шаблонів. Він має свою власну мета-мову, за допомогою 
якої він розуміє, як саме потрібно сформувати з шаблону готовий документ. Підтримує 
передачу Python-об'єктів, цикли, оператори розгалуження if.

Насправді немає жодної прив'язки саме до HTML. За замовчуванням шаблон сприймає:

    - код всередині {{ }} як Python код, який потрібно виконати і результат 
    перетворити на рядок, і підставити.
    - код всередині {% %} як вираз for або if, які впливають на те, як саме потрібно 
    рендерити шаблон до виразу {% endfor %} або {% endif %}. """

from jinja2 import Template

name = 'Bill'
age = 28

tm = Template("My name is {{ name }} and I am {{ age }}")
msg = tm.render(name=name, age=age)

print(msg)  # My name is Bill and I am 28
